{
  "country_code": "AG",
  "country": "Antigua and Barbuda",
  "city": "Saint John’s",
  "geonameid": 3576022,
  "target_addresses": 100,
  "count": 52,
  "addresses": [
    "518, Ebenezer, Saint Mary, 75956 Antigua, Antigua and Barbuda",
    "168, Turtle Dove Street, Piggotts, Saint George, 83850 Antigua, Antigua and Barbuda",
    "531, St. John's, Saint John, 64511 Antigua, Antigua and Barbuda",
    "762, Anchorage Road, St. John's, Saint John, 45137 Antigua, Antigua and Barbuda",
    "162, Cedar Valley Gardens, St. John's, Saint John, 00308 Antigua, Antigua and Barbuda",
    "091, Friars Hill Road, Saint John’s, 18909 Antigua, Antigua and Barbuda",
    "369, Cooks Dump Road, St. John's, Saint John, 82913 Antigua, Antigua and Barbuda",
    "07, Sir George Walter Highway, Potters Village, Saint George, 42635 Antigua, Antigua and Barbuda",
    "966, Yepton Road, St. John's, Saint John, 04913 Antigua, Antigua and Barbuda",
    "305, Fort Road, Saint John’s, 15196 Antigua, Antigua and Barbuda",
    "579, St. John's Street, Booby Lane, St. John's, Saint John, 76052 Antigua, Antigua and Barbuda",
    "457, Factory Road, Potters Village, Saint John, 31439 Antigua, Antigua and Barbuda",
    "219, Santa Maria Crescent, Cedar Grove, Saint John, 42334 Antigua, Antigua and Barbuda",
    "543, Cooks Dump, St. John's, Saint John, 97637 Antigua, Antigua and Barbuda",
    "584, Highaway Bay, St. John's, Saint John, 12302 Antigua, Antigua and Barbuda",
    "568, Jennings, Saint Mary, 57114 Antigua, Antigua and Barbuda",
    "965, Saint John’s, 27184 Antigua, Antigua and Barbuda",
    "840, Sea View Highway, Sea View Farm, Saint George, 72202 Antigua, Antigua and Barbuda",
    "953, Creek Side, Saint John, 75870 Antigua, Antigua and Barbuda",
    "362, Federation Road, St. John's, Saint John, 69310 Antigua, Antigua and Barbuda",
    "095, Potters Village, Saint John, 05892 Antigua, Antigua and Barbuda",
    "057, Perry Bay Road, St. John's, Saint John, 97940 Antigua, Antigua and Barbuda",
    "690, Valley Road, Saint John’s, 39580 Antigua, Antigua and Barbuda",
    "501, Bendals Road, Green Castle, Saint Mary, 76551 Antigua, Antigua and Barbuda",
    "189, Fountain Hill Road, St. John's, Saint John, 68743 Antigua, Antigua and Barbuda",
    "785, Pineapple Crescent, St. John's, Saint John, 46449 Antigua, Antigua and Barbuda",
    "053, Halcyon Road, Saint John’s, 09970 Antigua, Antigua and Barbuda",
    "765, Royal Antigua Hotel Drive, Five Islands, Saint John, 35408 Antigua, Antigua and Barbuda",
    "940, Pringle Street, St. John's, Saint John, 20559 Antigua, Antigua and Barbuda",
    "225, Blue Waters, Saint John, 10932 Antigua, Antigua and Barbuda",
    "581, Friars Hill Road, St. John's, Saint John, 74485 Antigua, Antigua and Barbuda",
    "737, Five Islands, Saint John, 49036 Antigua, Antigua and Barbuda",
    "024, Saint Clairs Estate Road, All Saints, Saint John, 56752 Antigua, Antigua and Barbuda",
    "357, Old Parham Road, Saint John’s, 27745 Antigua, Antigua and Barbuda",
    "829, All Saints, Saint John, 24417 Antigua, Antigua and Barbuda",
    "822, Sir Sidney Walling Highway, Saint John’s, 70386 Antigua, Antigua and Barbuda",
    "109, Sugarapple Drive, Piggotts, Saint George, 60344 Antigua, Antigua and Barbuda",
    "569, Bay Street, St. John's, Saint John, 44050 Antigua, Antigua and Barbuda",
    "185, Old Popeshead Road, St. John's, Saint John, 16408 Antigua, Antigua and Barbuda",
    "916, Dove Trail, St. John's, Saint John, 28684 Antigua, Antigua and Barbuda",
    "171, Fort Road, St. John's, Saint John, 90212 Antigua, Antigua and Barbuda",
    "557, Dickenson Bay Street, Antigua & Barbuda Port Authority, St. John's, Saint John, 23692 Antigua, Antigua and Barbuda",
    "139, Galley Bay Heights, Saint John’s, 54001 Antigua, Antigua and Barbuda",
    "312, Hall Valley Farm, Ebenezer, Saint Mary, 10377 Antigua, Antigua and Barbuda",
    "938, Cedar Valley Gardens, Barnes Hill, Saint John, 96772 Antigua, Antigua and Barbuda",
    "091, Palm Drive, Cedar Valley Gardens, New Winthorpes, Saint John, 60903 Antigua, Antigua and Barbuda",
    "170, Burning Flames Highway, Potters Village, Saint John, 64954 Antigua, Antigua and Barbuda",
    "771, Bendals Road, Bendals, Saint John, 87581 Antigua, Antigua and Barbuda",
    "019, Seafood Road, St. John's, Saint John, 56539 Antigua, Antigua and Barbuda",
    "769, Valley Road, Bolans, Saint Mary, 78601 Antigua, Antigua and Barbuda",
    "018, West Indies Oil Road, St. John's, Saint John, 04358 Antigua, Antigua and Barbuda",
    "026, Evanson Road, St. John's, Saint John, 20818 Antigua, Antigua and Barbuda"
  ],
  "updated_at": "2025-10-19T02:44:49.545999+00:00",
  "_kind": "checked_addrs"
}