{
  "country_code": "VI",
  "country": "U.S. Virgin Islands",
  "city": "Charlotte Amalie",
  "geonameid": 4795467,
  "target_addresses": 50,
  "count": 47,
  "addresses": [
    "366, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "355, Airport Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "2, Julian Jackson Drive, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "291, Haypiece Hill Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "467, Druif Point Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "939, Limestone Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "699, Dorothea Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "409, Hull Bay Road, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "20-21A, Kronprindsens Gade, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "848, Dorothy \"Dotsy\" Lockhart Elskoe Drive, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "676, Alton Adams Senior Drive, Charlotte Amalie, 00801 United States Virgin Islands, U.S. Virgin Islands",
    "259, Dorothea Bay Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "664, Rose Trail South, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "200, de Beltjen Road, Charlotte Amalie, 00801 United States Virgin Islands, U.S. Virgin Islands",
    "815, Lionel Pierre Berry Scenic Drive, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "542, Veterans Drive, Charlotte Amalie, 00801 United States Virgin Islands, U.S. Virgin Islands",
    "271, Cowell's Trail & Officers Quarter Trail, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "144, Lilliendal & Marienhoj Street, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "3017, Judy M. Gomez Highway, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "607, John de Jongh Promenade, Charlotte Amalie, 00801 United States Virgin Islands, U.S. Virgin Islands",
    "008, West Gregerie Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "888, Sandy Point Rock Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "861, Lavida Lane, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "985, Sand Bay Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "433, Lille Taarne Gade, Charlotte Amalie, 00801 United States Virgin Islands, U.S. Virgin Islands",
    "769, B Street, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "393, Neltjeberg Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "072, Rumer Road, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "51, Crown Mountain Road, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "867, Contant Street, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "383, Charlotte Amalie Historic District, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "367, Hawk Hill Road, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "648, Saint Peter Mountain Road, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "329, Limestone Bay Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "209, Main Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "977, Mahogany Estate Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "394, George A. Mena Scenic Drive, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "100, Subbase Road, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "84, Flamingo Road, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "864, Hassel View Lane, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "012, Edward Wilmot Blyden Boulevard, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "945, Veterans Drive West, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "1, Norde Tvær Gade, Charlotte Amalie, 00802 United States Virgin Islands, U.S. Virgin Islands",
    "408, Grambokola Hill Road, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands",
    "891, Rue de Chez Reuben, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "908, High Road, Charlotte Amalie, 00804 United States Virgin Islands, U.S. Virgin Islands",
    "174, Athniel C. \"Addie\" Ottley Drive, Charlotte Amalie, 00803 United States Virgin Islands, U.S. Virgin Islands"
  ],
  "updated_at": "2025-10-19T11:32:04.325524+00:00",
  "_kind": "checked_addrs"
}