{
  "country_code": "VI",
  "country": "U.S. Virgin Islands",
  "city": "Saint Croix",
  "geonameid": 4796512,
  "target_addresses": 50,
  "count": 30,
  "addresses": [
    "130, Northside Road, Saint Croix, 00851 United States Virgin Islands, U.S. Virgin Islands",
    "907, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "741, Hope Road, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "192, Granard Road, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "562, East Ridge Road, Saint Croix, 00820 United States Virgin Islands, U.S. Virgin Islands",
    "523, Clifton Hill Road, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "992, Jerusalem and Figtree Hill, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "242, Queen Mary Highway / Centerline Road, Saint Croix, 00851 United States Virgin Islands, U.S. Virgin Islands",
    "470, Golden Rock, Saint Croix, 00824 United States Virgin Islands, U.S. Virgin Islands",
    "180, West Street, Saint Croix, 00820 United States Virgin Islands, U.S. Virgin Islands",
    "516, Sion Farm, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "284, Kaira Avenue, Saint Croix, 00820 United States Virgin Islands, U.S. Virgin Islands",
    "715, Melvin H. Evans Highway, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "451, Claude A. Benjamin Memorial Drive, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "746, Humbug, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "980, Mesple Street, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "085, Fangselet Road, Saint Croix, 00821 United States Virgin Islands, U.S. Virgin Islands",
    "214, Lowry Hill Road / Southside Road, Saint Croix, 00824 United States Virgin Islands, U.S. Virgin Islands",
    "858, One Love Trail, Saint Croix, 00851 United States Virgin Islands, U.S. Virgin Islands",
    "298, Mayor General Jean Augustine Romney Memorial Drive, Saint Croix, 00851 United States Virgin Islands, U.S. Virgin Islands",
    "4007, Osprey Drive, Saint Croix, 00820 United States Virgin Islands, U.S. Virgin Islands",
    "822, Constitution Hill, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "144, Queen Street, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "717, Constitution Hill Road, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "8, Powell - Drummond Avenue, Saint Croix, 00850 United States Virgin Islands, U.S. Virgin Islands",
    "167, Sunset Road, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "424, Limetree, Saint Croix, 00822 United States Virgin Islands, U.S. Virgin Islands",
    "779, Cottage, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "909, Rattan Road, Saint Croix, 00823 United States Virgin Islands, U.S. Virgin Islands",
    "206, Mon Bijou Road, Saint Croix, 00851 United States Virgin Islands, U.S. Virgin Islands"
  ],
  "updated_at": "2025-10-19T06:42:28.015102+00:00",
  "_kind": "checked_addrs"
}