{
  "country_code": "BM",
  "country": "Bermuda",
  "city": "Hamilton",
  "geonameid": 3573197,
  "target_addresses": 100,
  "count": 68,
  "addresses": [
    "394, North Shore Road, Hamilton, DV 01 Devonshire, Bermuda",
    "212, North Shore Road, Hamilton, FL 03 Devonshire, Bermuda",
    "054, Hamilton, HM 01 Pembroke, Bermuda",
    "In Motion School of Dance, 71, Reid Street, City of Hamilton, HM 12, Bermuda",
    "2, North Shore Road, Hamilton, FL 03 Smith's, Bermuda",
    "673, Victoria Street, City of Hamilton, HM 11, Bermuda",
    "44, North Street, City of Hamilton, HM 17, Bermuda",
    "16, Middle Road, Hamilton, DV 03 Devonshire, Bermuda",
    "45, Middle Road, Hamilton, DV 06 Smith's, Bermuda",
    "466, Hamilton, 13416 Warwick, Bermuda",
    "281, Railway Trail, Flatts, Hamilton, FL 04, Bermuda",
    "69, Pitts Bay Road, Hamilton, HM 08 Pembroke, Bermuda",
    "19, Richmond Road, Hamilton, HM 08 Pembroke, Bermuda",
    "Fairmont Hamilton Princess, 76, Pitts Bay Road, Fairylands, Pembroke, HM 08, Bermuda",
    "10, Kings Court, City of Hamilton, Pembroke, HM 19, Bermuda",
    "Sung Sing Restaurant, 57, Victoria Street, City of Hamilton, HM 12, Bermuda",
    "105, Cedar Avenue, City of Hamilton, HM 09, Bermuda",
    "Mount Saint Agnes Academy, 19, Dundonald Street West, City of Hamilton, HM 09, Bermuda",
    "19, Dundonald Street West, HM 09 Hamilton, Bermuda",
    "19, Elliott Street, City of Hamilton, HM 10, Bermuda",
    "35, Church Street, City of Hamilton, HM 12, Bermuda",
    "Baháʼí National Centre, 8, Brunswick Street, City of Hamilton, HM 10, Bermuda",
    "E.W. Pearman Building, 20, Brunswick Street, City of Hamilton, HM 10, Bermuda",
    "Magnolia Place, 45, Victoria Street, City of Hamilton, HM 12, Bermuda",
    "St. Paul AME Church, 59, Court Street, City of Hamilton, HM 12, Bermuda",
    "455, Front Street, HM 12 Hamilton, Bermuda",
    "City Hall & Arts Centre, 17, Church Street, City of Hamilton, HM 11, Bermuda",
    "540, Cedar Avenue, HM 11 Hamilton, Bermuda",
    "617, Dundonald Street West, City of Hamilton, HM 09, Bermuda",
    "Melbourne House, 11, Parliament Street, City of Hamilton, HM 12, Bermuda",
    "Marks & Spencer, 18, Reid Street, City of Hamilton, HM 11, Bermuda",
    "A.S. Cooper, 59, Front Street, City of Hamilton, HM 11, Bermuda",
    "4, Parliament Street, City of Hamilton, HM 12, Bermuda",
    "Bermuda Public Storage, 21, Elliott Street, City of Hamilton, HM 10, Bermuda",
    "Sophia House, 48, Church Street, City of Hamilton, HM 12, Bermuda",
    "443, Victoria Street, HM 11 Hamilton, Bermuda",
    "Bolero Brasserie, 95, Front Street, City of Hamilton, HM 12, Bermuda",
    "Cathedral of St. Theresa, 34, Cedar Avenue, City of Hamilton, Pembroke, HM 09, Bermuda",
    "671, Dundonald Street, City of Hamilton, HM 10, Bermuda",
    "Hilltop, 14, Princess Street, City of Hamilton, HM 10, Bermuda",
    "The MarketPlace, 35, Victoria Street, City of Hamilton, HM 12, Bermuda",
    "Cathedral of St. Theresa Rectory, 13, Elliott Street West, City of Hamilton, HM 09, Bermuda",
    "Dame Lois Browne-Evans Building, 58, Court Street, City of Hamilton, HM 12, Bermuda",
    "538, Washington Street, City of Hamilton, HM 09, Bermuda",
    "Park Place Condominiums, 6, Dundonald Street, City of Hamilton, HM 10, Bermuda",
    "Stevedore House, 38, Front Street, City of Hamilton, HM 12, Bermuda",
    "429, Court Street, HM 12 Hamilton, Bermuda",
    "Gosling's, 9, Dundonald Street, City of Hamilton, HM 10, Bermuda",
    "7, Joell's Alley, City of Hamilton, HM 12, Bermuda",
    "198, Brunswick Street, HM 10 Hamilton, Bermuda",
    "6, Brunswick Street, City of Hamilton, HM 10, Bermuda",
    "The MarketPlace, 42, Church Street, City of Hamilton, HM 12, Bermuda",
    "The F.B. Perry Building, 40, Church Street, City of Hamilton, HM 12, Bermuda",
    "Bay 1 - Route 10, Washington Street South, City of Hamilton, HM 11, Bermuda",
    "Pedal Spot, 13, Dundonald Street West, City of Hamilton, HM 09, Bermuda",
    "General Post Office, 56, Church Street, City of Hamilton, HM 12, Bermuda",
    "Wesley Methodist Church, 41, Church Street, City of Hamilton, HM 12, Bermuda",
    "Serenity Dental – Dr. Keira Smith, 16, Brunswick Street, City of Hamilton, HM 10, Bermuda",
    "42, Reid Street, City of Hamilton, HM 12, Bermuda",
    "11, Parliament Street, HM 12 Hamilton, Bermuda",
    "Williams House, 20, Reid Street, City of Hamilton, HM 11, Bermuda",
    "Sea Venture Building, 19, Parliament Street, City of Hamilton, HM 12, Bermuda",
    "Government Offices, 43, Church Street, City of Hamilton, HM 12, Bermuda",
    "United Dance Productions, 75, Court Street, City of Hamilton, HM 12, Bermuda",
    "206, Washington Lane, HM 11 Hamilton, Bermuda",
    "9, Dundonald Street, HM 10 Hamilton, Bermuda",
    "10, Burnaby Street, City of Hamilton, HM 11, Bermuda",
    "21, Elliott Street, HM 10 Hamilton, Bermuda"
  ],
  "updated_at": "2025-10-22T01:06:37.639152+00:00",
  "_kind": "checked_addrs"
}