{
  "country_code": "GD",
  "country": "Grenada",
  "city": "Saint George's",
  "geonameid": 3579925,
  "target_addresses": 100,
  "count": 106,
  "addresses": [
    "080, Morne Rouge Road, Morne Rouge, 58135 Saint George, Grenada",
    "007, Springs, Morne Jaloux, 24318 Saint George, Grenada",
    "553, Mount Moritz, 80804 Saint George, Grenada",
    "079, Perdmontemps, 65620 Saint David, Grenada",
    "065, Karland Park, Grand Anse, 64157 Saint George, Grenada",
    "398, Grenville Vale Road, Grenville Vale, 59088 Saint George, Grenada",
    "258, Jean Anglais Road, Belmont, Grand Anse, 96596 Saint George, Grenada",
    "800, Western Road, Cherry Hill, 13366 Saint George, Grenada",
    "648, Belmont, Grand Anse, 61558 Saint George, Grenada",
    "812, Fontenoy Road, Mount Gay, Fontenoy, 28430 Saint George, Grenada",
    "122, Mount Gay, Beaulieu, 44152 Saint George, Grenada",
    "107, Woburn Road, Woburn, 79312 Saint George, Grenada",
    "035, Western Road, Grand Mal, Mount Gay, Grand Mal, 37099 Saint George, Grenada",
    "433, Cherry Hill, 13914 Saint George, Grenada",
    "072, Park Lane, Belmont, St. George's, 42587 Saint George, Grenada",
    "719, Ravine Road, Mount Gay, La Mode, 11684 Saint George, Grenada",
    "399, Mount Gay, Fontenoy, 30418 Saint George, Grenada",
    "869, Morne Rouge, 83241 Saint George, Grenada",
    "931, Fence Road, Happy Hill, 83651 Saint George, Grenada",
    "174, Marast Hill Road, Tempe, River Road, 58275 Saint George, Grenada",
    "943, Lyda, Marian, 59913 Saint George, Grenada",
    "106, Back Street, Tempe, La Mode, 49250 Saint George, Grenada",
    "487, Grenville Vale, 40414 Saint George, Grenada",
    "656, Mandella's Drive, Beaulieu, 99299 Saint George, Grenada",
    "630, Paddock Road, Belmont, St. George's, 51529 Saint George, Grenada",
    "775, Tempe, Mount Parnassus, 92114 Saint George, Grenada",
    "368, Old Westerhall, 24795 Saint David, Grenada",
    "146, BBC Beach Road, Morne Rouge, 58767 Saint George, Grenada",
    "256, Marian Road, Calivigny, 42583 Saint George, Grenada",
    "209, Morne Gazo, 16888 Saint David, Grenada",
    "278, Calivigny, 77494 Saint George, Grenada",
    "080, Mount Gay, La Mode, 87880 Saint George, Grenada",
    "974, Mount Airy Road, Mount Airy, Marlborough, 97870 Saint George, Grenada",
    "463, Woodlands Main Road, 66303 Saint George's, Grenada",
    "319, The Bocas Road, Springs, La Borie, 01287 Saint George, Grenada",
    "721, Western Road, Grand Mal, 77682 Saint George, Grenada",
    "937, La Luna Road, Morne Rouge, 98378 Saint George, Grenada",
    "571, Melville Street, Belmont, St. George's, 68786 Saint George, Grenada",
    "741, Fenton Village, Grand Anse, 43003 Saint George, Grenada",
    "757, Saint Paul's Road, Tempe, Marlborough, 55550 Saint George, Grenada",
    "077, Woburn, 29276 Saint George, Grenada",
    "661, Radix Road, Tempe, Mount Parnassus, 45621 Saint George, Grenada",
    "430, La Mode Road, Mount Gay, La Mode, 09528 Saint George, Grenada",
    "553, Grand Mal, 96608 Saint George, Grenada",
    "935, Golf Course Hill Road, Fenton Village, Grand Anse, 92300 Saint George, Grenada",
    "935, Good Hope Road, Mount Airy, Mardigras, 34503 Saint George, Grenada",
    "345, Springs, La Borie, 89081 Saint George, Grenada",
    "977, Saint George - Grenville Road, Mount Gay, Beaulieu, 47838 Saint George, Grenada",
    "591, Moliniere, 08228 Saint George, Grenada",
    "816, Golf Course Road, Fenton Village, Grand Anse, 97616 Saint George, Grenada",
    "977, Saint Paul's Road, Springs, La Borie, 78157 Saint George, Grenada",
    "049, Tempe, Saint Paul's, 19581 Saint George, Grenada",
    "863, Jones Road, Mount Moritz, 26945 Saint George, Grenada",
    "806, Belmont, St. George's, 67286 Saint George, Grenada",
    "430, Springs Road, Springs, Morne Jaloux, 92705 Saint George, Grenada",
    "636, Grenville Vale Road, Beausejour, 02914 Saint George, Grenada",
    "270, Mount Airy, Mardigras, 53026 Saint George, Grenada",
    "375, Corbeau Road, Mount Airy, Mardigras, 58916 Saint George, Grenada",
    "551, Deagar Road, Willis, 46187 Saint George, Grenada",
    "544, Western Road, 68587 Saint George's, Grenada",
    "224, Saint Paul's Road, Mount Airy, Saint Paul's, 78460 Saint David, Grenada",
    "564, Morne Delice - Old Westerhall Road, Mount Airy, Marlborough, 24534 Saint George, Grenada",
    "297, Port Highway, 39196 Saint George's, Grenada",
    "292, Grand Anse Road, Fenton Village, Grand Anse, 17404 Saint George, Grenada",
    "540, Bellevue Road, Mount Gay, Beaulieu, 24988 Saint George, Grenada",
    "087, Old Fort Road, Tempe, St. George's, 46649 Saint George, Grenada",
    "704, Mount Airy, Marlborough, 09217 Saint George, Grenada",
    "708, Springs, Grand Anse, 07976 Saint George, Grenada",
    "234, Corbeau Road, Mount Airy, Mardigras, 13927 Saint David, Grenada",
    "721, Tempe, St. George's, 38270 Saint George, Grenada",
    "549, Saint Paul's Road, 66171 Saint George's, Grenada",
    "447, Mount Gay, River Road, 12003 Saint George, Grenada",
    "262, Kirani James Boulevard, Belmont, Grand Anse, 70243 Saint George, Grenada",
    "517, Darbeau Road, Mount Gay, Darbeau, 75755 Saint George, Grenada",
    "387, Mandella's Drive, Boca, 43846 Saint George, Grenada",
    "689, Home Avenue, Valley View, Springs, Morne Jaloux, 21516 Saint George, Grenada",
    "196, Woodlands Main Road, Woburn, 51492 Saint George, Grenada",
    "567, Karland Park Road, Karland Park, Grand Anse, 58457 Saint George, Grenada",
    "621, Grand Etang Road, 20394 Saint George's, Grenada",
    "868, Bruce Street, 35524 Saint George's, Grenada",
    "293, Morne Rouge Road, Grand Anse, 49354 Saint George, Grenada",
    "393, Boca Road, Mount Gay, Boca, 03143 Saint George, Grenada",
    "017, Cafe Road, Springs, Grand Anse, 29742 Saint George, Grenada",
    "178, La Borie - Confer Road, Mount Airy, La Borie, 57725 Saint George, Grenada",
    "226, Cemetery Road, 41904 Saint George's, Grenada",
    "752, Mortley Hill Road, Tempe, River Road, 85367 Saint George, Grenada",
    "853, Mount Parnassus Road, Tempe, Mount Parnassus, 22777 Saint George, Grenada",
    "436, Wharf Road, Belmont, St. George's, 36577 Saint George, Grenada",
    "358, Atic Road, Mount Airy, Mardigras, 45904 Saint George, Grenada",
    "332, Hope Vale Road, Mount Airy, Lyda, Hope Vale, 04633 Saint George, Grenada",
    "489, Eastern Road, Calivigny, 92242 Saint George, Grenada",
    "828, Woolwich Road, Tempe, St. George's, 09500 Saint George, Grenada",
    "062, Aros Road, Mount Airy, Hope Vale, 11269 Saint George, Grenada",
    "269, Saint George - Grenville Road, Beaulieu, 29430 Saint George, Grenada",
    "491, Lowthers Lane, 41995 Saint George's, Grenada",
    "533, Mardigras Road, Mardigras, 78259 Saint George, Grenada",
    "706, Saint Juille Street, Belmont, St. George's, 95534 Saint George, Grenada",
    "144, Queen's Park Road, Mount Gay, Cherry Hill, 25730 Saint George, Grenada",
    "776, Frequente Road, Frequente, 54485 Saint George, Grenada",
    "466, Richmond Hill Road, Tempe, St. George's, 95432 Saint George, Grenada",
    "200, Playing Field Road, Lyda, Marian, 36702 Saint George, Grenada",
    "439, The Carenage, 80825 Saint George's, Grenada",
    "872, Herbert Blaize Street, Belmont, St. George's, 42923 Saint George, Grenada",
    "684, Glean's Road, 99597 Saint George's, Grenada",
    "643, Petersfield Road, Springs, La Borie, 03578 Saint George, Grenada",
    "038, Cambeliar Road, Mardigras, 33679 Saint George, Grenada"
  ],
  "updated_at": "2025-10-19T04:24:19.737121+00:00",
  "_kind": "checked_addrs"
}